Revit 2026 API

# HVACLoadTypeLightingLoadDensity Property

---

The lighting load density.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double LightingLoadDensity { get; set; }
```
```vb
Public Property LightingLoadDensity As Double
	Get
	Set
```
```cpp
public:
property double LightingLoadDensity {
	double get ();
	void set (double value);
}
```
```fsharp
member LightingLoadDensity : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The value should be between [0.0,500000.0]. |

#### Reference

HVACLoadType Class

Autodesk.Revit.DB.Analysis Namespace